tinkode56/AirQM_ESP32C3/main/airqm_main.c
/*
 * @Author: calin.acr 
 * @Date: 2024-03-15 14:00:51 
 * @Last Modified by: calin.acr
 * @Last Modified time: 2024-07-09 21:27:15
 */

#include <stdio.h>
#include <inttypes.h>
#include "sdkconfig.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_chip_info.h"
#include "esp_flash.h"
#include "esp_system.h"
#include "oled_display.h"
#include "sgp41.h"
#include "sht45.h"
#include "string.h"
#include "esp_timer.h"
#include "esp_random.h"
#include "sensirion_gas_index_algorithm.h"
#include "senseair_s8.h"
#include "airqm_main.h"
#include "pms5003.h"
#include "nvs_flash.h"
#include "airqm_wifi.h"
#include "airqm_influxdb.h"
#include "esp_sntp.h"
#include "esp_netif_sntp.h"
#include "led_strip.h"
#include "board_support.h"

QueueHandle_t i2cdev_queue;
QueueHandle_t s8_queue;
QueueHandle_t pms_queue;
QueueHandle_t oled_queue;
QueueHandle_t influxdb_queue;

TaskHandle_t xOledTaskHandle = NULL;
TaskHandle_t xI2CDevTaskHandle = NULL;
TaskHandle_t xSenseairTaskHandle = NULL;
TaskHandle_t xPMSTaskHandle = NULL;
TaskHandle_t xDataManagerHandle = NULL;
TaskHandle_t xInfluxManagerHandle = NULL;
TaskHandle_t xNeopixelManagerHandle = NULL;

/* Task stack sizes in bytes */
const uint16_t oled_stack_size = 3000;
const uint16_t i2c_stack_size = 3000;
const uint16_t senseair_stack_size = 2800;
const uint16_t pms_stack_size = 2800;
const uint16_t datmgr_stack_size = 1500;
const uint16_t influx_stack_size = 5000;
const uint16_t neopixel_stack_size = 3000;


void vOledTask(void *pvParameters);
void vI2CDevTask(void *pvParameters);
void vSenseairTask(void *pvParameters);
void vDataManagerTask(void *pvParameters);
void vInfluxDBManagerTask(void *pvParameters);
void vNeopixelManagerTask(void *pvParameters);

void SyncTime(void);


void app_main(void)
{
    // Wifi provisioning and connection init
    // airqm_wifiprov_init();

    // Create queue between i2c and oled task
    i2cdev_queue = xQueueCreate(3, sizeof(struct I2CDevMessage *));
    s8_queue = xQueueCreate(3, sizeof(uint16_t));
    pms_queue = xQueueCreate(3, sizeof(struct PMSData *));
    oled_queue = xQueueCreate(3, sizeof(AirQM_metrics));
    influxdb_queue = xQueueCreate(3, sizeof(AirQM_metrics));
    
    // Initialize the I2C master bus
    i2c_master_bus_config_t conf = {
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .i2c_port = I2C_NUM_0,
        .sda_io_num = AIRQM_I2C_SDA,
        .scl_io_num = AIRQM_I2C_SCL,
        .glitch_ignore_cnt = 7,
        .flags.enable_internal_pullup = true,
    };
    i2c_master_bus_handle_t bus_handle;
    ESP_ERROR_CHECK(i2c_new_master_bus(&conf, &bus_handle));

    xTaskCreate(vDataManagerTask, "DataMgr TASK", datmgr_stack_size, NULL, 11, &xDataManagerHandle);
    configASSERT(xDataManagerHandle);

    // xTaskCreate(vInfluxDBManagerTask, "InfluxMgr TASK", influx_stack_size, NULL, 11, &xInfluxManagerHandle);
    // configASSERT(xInfluxManagerHandle);

    xTaskCreate(vI2CDevTask, "I2CDev TASK", i2c_stack_size, (void *)bus_handle, 11, &xI2CDevTaskHandle);
    configASSERT(xI2CDevTaskHandle);

    xTaskCreate(vOledTask, "OLED TASK", oled_stack_size, NULL, 11, &xOledTaskHandle);
    configASSERT(xOledTaskHandle);

    xTaskCreate(vSenseairTask, "SENSEAIR TASK", senseair_stack_size, NULL, tskIDLE_PRIORITY, &xSenseairTaskHandle);
    configASSERT(xSenseairTaskHandle);

    xTaskCreate(PMS_MainTask, "PMS5003 TASK", pms_stack_size, (void *)pms_queue, tskIDLE_PRIORITY, &xPMSTaskHandle);
    configASSERT(xPMSTaskHandle);

    xTaskCreate(vNeopixelManagerTask, "Neopixel TASK", neopixel_stack_size, NULL, tskIDLE_PRIORITY, &xNeopixelManagerHandle);
    configASSERT(xNeopixelManagerHandle);

    for ( ;; )
    {
        /* Stack size measurements */
        ESP_LOGE("APP_MAIN", "Oled task stack unused bytes: %d", uxTaskGetStackHighWaterMark(xOledTaskHandle));
        ESP_LOGE("APP_MAIN", "I2C task stack unused bytes: %d", uxTaskGetStackHighWaterMark(xI2CDevTaskHandle));
        ESP_LOGE("APP_MAIN", "Senseair task stack unused bytes: %d", uxTaskGetStackHighWaterMark(xSenseairTaskHandle));
        ESP_LOGE("APP_MAIN", "PMS5003 task stack unused bytes: %d", uxTaskGetStackHighWaterMark(xPMSTaskHandle));
        ESP_LOGE("APP_MAIN", "DataMgr task stack unused bytes: %d", uxTaskGetStackHighWaterMark(xDataManagerHandle));
        ESP_LOGE("APP_MAIN", "InfluxMgr task stack unused bytes: %d", uxTaskGetStackHighWaterMark(xInfluxManagerHandle));
        ESP_LOGE("APP_MAIN", "NeopixelMgr task stack unused bytes: %d", uxTaskGetStackHighWaterMark(xNeopixelManagerHandle));
        vTaskDelay(pdMS_TO_TICKS(5000));
    }
}

void vOledTask(void *pvParameters)
{
    ESP_LOGW("OLED_TASK", "Task started");
    
    char temp_buff[7] = "wait  ";
    char hum_buff[7] = "wait  ";
    char co2_buff[6] = "wait ";
    char pm10_buff[6] = "wait ";
    char pm25_buff[6] = "wait ";
    char pm100_buff[6] = "wait ";
    char tvoc_buff[6] = "wait ";
    char nox_buff[6] = "wait ";

    AirQM_metrics allMetrics = { 0 };

    oled_init();
    
    oled_draw_text("AirQM -> Meow TECH", 0, 1);

    oled_draw_text(temp_buff, 1, 0);
    oled_draw_text("~C", 1, 6);
    oled_draw_text(hum_buff, 1, 12);
    oled_draw_text("%RH", 1, 18);
    
    oled_draw_text("CO2", 2, 0);
    oled_draw_text(co2_buff, 2, 7);
    oled_draw_text("ppm", 2, 14);

    oled_draw_text("PM1.0", 3, 0);
    oled_draw_text(pm10_buff, 3, 7);
    oled_draw_text("ug/m3", 3, 14);

    oled_draw_text("PM2.5", 4, 0);
    oled_draw_text(pm25_buff, 4, 7);
    oled_draw_text("ug/m3", 4, 14);

    oled_draw_text("PM10", 5, 0);
    oled_draw_text(pm100_buff, 5, 7);
    oled_draw_text("ug/m3", 5, 14);

    oled_draw_text("VOC", 6, 0);
    oled_draw_text(tvoc_buff, 6, 7);

    oled_draw_text("NOx", 7, 0);
    oled_draw_text(nox_buff, 7, 7);

    oled_flush();

    for( ;; )
    {
        // Task body
        if (oled_queue != 0)
        {
            if (xQueueReceive(oled_queue, &(allMetrics), (TickType_t) 10))
            {
                // Convert values to strings
                sprintf(temp_buff, "%6.2f", allMetrics.temp_phy);
                sprintf(hum_buff, "%6.2f", allMetrics.hum_phy);
                sprintf(tvoc_buff, "%5ld", allMetrics.voc_index_value);
                sprintf(nox_buff, "%5ld", allMetrics.nox_index_value);
                sprintf(co2_buff, "%5d", allMetrics.co2_val);
                sprintf(pm10_buff, "%5d", allMetrics.pm10_std);
                sprintf(pm25_buff, "%5d", allMetrics.pm25_std);
                sprintf(pm100_buff, "%5d", allMetrics.pm100_std);
                // Write to GDDRAM
                oled_draw_text(temp_buff, 1, 0);
                oled_draw_text(hum_buff, 1, 12);
                oled_draw_text(tvoc_buff, 6, 7);
                oled_draw_text(nox_buff, 7, 7);
                oled_draw_text(co2_buff, 2, 7);
                oled_draw_text(pm10_buff, 3, 7);
                oled_draw_text(pm25_buff, 4, 7);
                oled_draw_text(pm100_buff, 5, 7);
                // Flush GDDRAM to display
                oled_flush();
            }
            
        }
    }
}

void vI2CDevTask(void *pvParameters)
{
    ESP_LOGW("I2C TASK", "Task started");

    struct I2CDevMessage *pxMessage;
    i2c_master_bus_handle_t bus_handle;

    bus_handle = (i2c_master_bus_handle_t) pvParameters;
    pxMessage = &xI2CDevMessage;

    uint8_t conditioning_counter = 0;

    uint16_t sht45_temp_raw;
    uint16_t sht45_hum_raw;
    uint16_t sgp41_voc_raw;
    uint16_t sgp41_nox_raw;

    GasIndexAlgorithmParams voc_params;
    GasIndexAlgorithmParams nox_params;

    GasIndexAlgorithm_init(&voc_params, GasIndexAlgorithm_ALGORITHM_TYPE_VOC);
    GasIndexAlgorithm_init(&nox_params, GasIndexAlgorithm_ALGORITHM_TYPE_NOX);

    // SHT45 init and reset
    SHT45_Init(&bus_handle);
    SHT45_SoftReset();


    // SGP41 init
    SGP41_Init(&bus_handle);

    // SGP41 conditioning (1 command every second, max 10 seconds)
    while (conditioning_counter < 10)
    {
        SGP41_ExecuteConditioning(&sgp41_voc_raw);
        // Count as conditioning iteration done
        conditioning_counter++;
        // Wait one second
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
    
    for ( ;; )
    {
        // Task body
        // Read data from I2C sensors
        SHT45_Read(SHT45_MODE_HIGH_PRECISION_NO_HEATER, &sht45_temp_raw, &pxMessage->temp_phy, &sht45_hum_raw, &pxMessage->hum_phy);
        SGP41_MeasureRawSignals(sht45_temp_raw, sht45_hum_raw, &sgp41_voc_raw, &sgp41_nox_raw);

        // ESP_LOGI("SGP", "RAW VOC %d, NOx %d", sgp41_voc_raw, sgp41_nox_raw);

        // Use Sensirion Algorithm to get VOC and NOx indices
        GasIndexAlgorithm_process(&voc_params, sgp41_voc_raw, &pxMessage->voc_index_value);
        GasIndexAlgorithm_process(&nox_params, sgp41_nox_raw, &pxMessage->nox_index_value);
        
        // ESP_LOGI("SGP", "VOC %ld, NOx %ld", pxMessage->voc_index_value, pxMessage->nox_index_value);

        if (i2cdev_queue != 0)
        {
            if(xQueueSendToBack(i2cdev_queue, (void *) &pxMessage, (TickType_t) 0) != pdPASS)
            {
                ESP_LOGE("I2C TASK", "Failed to post the message");
            }
        }
        
        vTaskDelay(pdMS_TO_TICKS(1000));
        

        // taskYIELD();
    }
}


void vSenseairTask(void *pvParameters)
{
    ESP_LOGW("S8 TASK", "Task started");
    // uint8_t cal_status;
    uint16_t co2_value, status;
    uint16_t abc, memmap_ver, fw_ver;
    uint32_t sens_type_id, sens_id;
    
    SenseairS8_Init();
    
    // cal_status = S8_BgCalibration(CO2_BG_CAL);
    // ESP_LOGI("S8 TASK", "Calibration status %d", cal_status);
    
    S8_ReadSensorTypeID(&sens_type_id);
    ESP_LOGI("S8 TASK", "Sensor Type ID 0x%08jx", (uintmax_t)sens_type_id);

    S8_ReadABC(&abc);
    ESP_LOGI("S8 TASK", "ABC period 0x%04x, %d hours", abc, abc);

    S8_ReadMemMapVers(&memmap_ver);
    ESP_LOGI("S8 TASK", "Memory Mapping ver 0x%04x", memmap_ver);

    S8_ReadFWVers(&fw_ver);
    ESP_LOGI("S8 TASK", "Firmware ver 0x%04x", fw_ver);

    S8_ReadSensorID(&sens_id);
    ESP_LOGI("S8 TASK", "Sensor ID (SN) 0x%08jx", (uintmax_t)sens_id);
    
    for( ;; )
    {
        vTaskDelay(pdMS_TO_TICKS(4000));
        S8_ReadCO2andStatus(&co2_value, &status);
        
        if ((s8_queue != 0) && (!CHECK_ERROR_ANY(status)))
        {
            if (xQueueSendToBack(s8_queue, (void *) &co2_value, (TickType_t) 0) != pdTRUE)
            {
                ESP_LOGE("S8 TASK", "Failed to post the message");
            }
        }
    }
}

void SyncTime(void)
{
    // Synchronize time with NTP
    if ( esp_sntp_enabled() ) {
        esp_sntp_stop();
    }
    esp_sntp_setoperatingmode(ESP_SNTP_OPMODE_POLL);
    ESP_LOGI("NTP-Sync", "Getting time via NTP from: %s", CONFIG_AIRQM_NTP_SERVER);
    esp_sntp_setservername(0, CONFIG_AIRQM_NTP_SERVER);
    
    const int total_max_retries = 3;
    int total_retries = 0;
    time_t now = 0;
    struct tm timeinfo = { 0 };
    do {
        esp_sntp_init();

        int retry = 0;

        // NTP request is sent every 15 seconds, so wait 25 seconds for sync.
        const int retry_count = 10;
        while ((sntp_get_sync_status() == SNTP_SYNC_STATUS_RESET) && (++retry < retry_count)) {
            ESP_LOGI("NTP-Sync", "Waiting for system time to be set... (%d/%d)", retry, retry_count);
            vTaskDelay(2000 / portTICK_PERIOD_MS);
        }
        if (retry == retry_count) {
            total_retries += 1;
            esp_sntp_stop();
        } else {
            break;
        }
    } while (total_retries < total_max_retries);
    assert(total_retries < total_max_retries);

    time(&now);
    localtime_r(&now, &timeinfo);

    char strftime_buf[64];
    strftime(strftime_buf, sizeof(strftime_buf), "%c", &timeinfo);
    ESP_LOGI("NTP-Sync", "The current date/time is: %s", strftime_buf);
}

void vDataManagerTask(void *pvParameters)
{
    struct I2CDevMessage *pxMessage;
    uint16_t co2_ppm;
    struct PMSRecvMessage *pxPMSMessage;

    AirQM_metrics allMetrics = { 0 };
    bool isAnyMetricUpdated = false;

    TickType_t xLastWakeTime;
    // Frequency of data write in InfluxDB (1 min = 60000 ms)
    const TickType_t xFrequency = pdMS_TO_TICKS(60000);

    xLastWakeTime = xTaskGetTickCount();

    for ( ;; )
    {
        if (i2cdev_queue != 0)
        {
            if (xQueueReceive(i2cdev_queue, &(pxMessage), (TickType_t) 10))
            {
                // Update allMetrict to be sent to InfluxDB
                allMetrics.temp_phy = pxMessage->temp_phy;
                allMetrics.hum_phy = pxMessage->hum_phy;
                allMetrics.voc_index_value = pxMessage->voc_index_value;
                allMetrics.nox_index_value = pxMessage->nox_index_value;
                // Signal metric values have updated
                isAnyMetricUpdated = true;
            }
        }

        if (s8_queue != 0)
        {
            if (xQueueReceive(s8_queue, &co2_ppm, (TickType_t) 10))
            {
                // Update allMetrict to be sent to InfluxDB
                allMetrics.co2_val = co2_ppm;
                // Signal metric values have updated
                isAnyMetricUpdated = true;
            }
        }

        if (pms_queue != 0)
        {
            if (xQueueReceive(pms_queue, &(pxPMSMessage), (TickType_t) 10))
            {
                // Update allMetrict to be sent to InfluxDB
                allMetrics.pm10_std = pxPMSMessage->pm10_std;
                allMetrics.pm25_std = pxPMSMessage->pm25_std;
                allMetrics.pm100_std = pxPMSMessage->pm100_std;
                allMetrics.pm10_env = pxPMSMessage->pm10_env;
                allMetrics.pm25_env = pxPMSMessage->pm25_env;
                allMetrics.pm100_env = pxPMSMessage->pm100_env;
                allMetrics.particles_03um = pxPMSMessage->particles_03um;
                allMetrics.particles_05um = pxPMSMessage->particles_05um;
                allMetrics.particles_10um = pxPMSMessage->particles_10um;
                allMetrics.particles_25um = pxPMSMessage->particles_25um;
                allMetrics.particles_50um = pxPMSMessage->particles_50um;
                allMetrics.particles_100um = pxPMSMessage->particles_100um;
                // Signal metric values have updated
                isAnyMetricUpdated = true;
            }
        }

        if (isAnyMetricUpdated)
        {
            // Send data to OLED
            if (oled_queue != 0)
            {
                if(xQueueSendToBack(oled_queue, (void *) &allMetrics, (TickType_t) 0) != pdPASS)
                {
                    ESP_LOGE("AqmDataManager", "Failed to post the message to oled queue");
                }
                else
                {
                    isAnyMetricUpdated = false;
                }
            }
        }

        if (xTaskGetTickCount() - xLastWakeTime >= xFrequency)
        {
            // Send data to InfluxDB Manager
            if (influxdb_queue != 0)
            {
                // if(xQueueSendToBack(influxdb_queue, (void *) &allMetrics, (TickType_t) 0) != pdPASS)
                // {
                //     ESP_LOGE("AqmDataManager", "Failed to post the message to influxdb queue");
                // }
            }
            // Update last wake time with current time
            xLastWakeTime = xTaskGetTickCount();
        }
    }
    
}

void vInfluxDBManagerTask(void *pvParameters)
{
    AirQM_metrics allMetrics = { 0 };
    
    // Set timezone
    ESP_LOGI("NTP-Sync", "Timezone is set to: %s", CONFIG_AIRQM_NTP_TZ);
    setenv("TZ", CONFIG_AIRQM_NTP_TZ, 1);
    tzset();

    // Synchronize time
    SyncTime();

    for ( ;; )
    {
        if (influxdb_queue != 0)
        {
            if (xQueueReceive(influxdb_queue, &(allMetrics), (TickType_t) 10))
            {
                // Write data into InfluxDB
                write_influxdb(&allMetrics);
                // Re-sync with NTP server
                SyncTime();
            }
        }
    }
}

#define PIXEL_COUNT  10


void vNeopixelManagerTask(void *pvParameters)
{  

    /* LED strip initialization with the GPIO and pixels number*/
    led_strip_config_t strip_config = {
        .strip_gpio_num = AIRQM_NEOPIXEL_PIN, // The GPIO that connected to the LED strip's data line
        .max_leds = PIXEL_COUNT, // The number of LEDs in the strip,
        .led_pixel_format = LED_PIXEL_FORMAT_GRB, // Pixel format of your LED strip
        .led_model = LED_MODEL_WS2812, // LED strip model
        .flags.invert_out = false, // whether to invert the output signal (useful when your hardware has a level inverter)
    };

    led_strip_rmt_config_t rmt_config = {
    #if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 0, 0)
        .rmt_channel = 0,
    #else
        .clk_src = RMT_CLK_SRC_DEFAULT, // different clock source can lead to different power consumption
        .resolution_hz = 10 * 1000 * 1000, // 10MHz
        .flags.with_dma = false, // whether to enable the DMA feature
    #endif
    };

    // LED Strip object handle
    led_strip_handle_t led_strip;
    ESP_ERROR_CHECK(led_strip_new_rmt_device(&strip_config, &rmt_config, &led_strip));

    uint32_t maxhue = 360;
    uint8_t position = 0;

    vTaskDelay(pdMS_TO_TICKS(5000));

    for (uint8_t i = 0; i < PIXEL_COUNT; i++)
    {
        ESP_ERROR_CHECK(led_strip_set_pixel_hsv(led_strip, (i+position)%10, i*(maxhue / 10) , 255, 10));
    }
    
    for ( ;; )
    {
        /* Set the LED pixel using RGB from 0 (0%) to 255 (100%) for each color */
        // for (uint8_t i = 0; i < PIXEL_COUNT; i++)
        // {
        //     ESP_ERROR_CHECK(led_strip_set_pixel_hsv(led_strip, (i+position)%10, i*(maxhue / 10) , 255, 10));
        // }

        // /* Refresh the strip to send data */
        // ESP_ERROR_CHECK(led_strip_refresh(led_strip));

        // position++;
        // position%=10;
        vTaskDelay(pdMS_TO_TICKS(20));
    }
}